1. 문제 정의
커피 판매량은 월, 요일, 시간대에 따라 달라질 수 있다. 이러한 정보를 이용하여 시간대별 커피 판매량을 예측할 수 있는지 알아본다.

2. 데이터 수집
커피 판매점의 판매 기록에서 판매 날짜, 요일, 시간, 판매 금액, 커피 종류 등의 데이터를 수집한다.

| 속성명       | 설명                                          |
| ------------| --------------------------------------------- |
| Date        | 커피가 판매된 날짜                              |
| Month       | 판매된 월을 숫자로 나타낸 값                     |
|Month_name   | 판매된 월의 이름                                |
| Day         | 판매된 날짜의 일                                |
| Weekday     | 판매된 요일                                     |
| Weekdaysort | 요일의 순서를 숫자로 나타낸 값(월요일 1~일요일 7) |
| hour_of_day | 커피가 판매된 시간(시)                          |
| is_weekend  | 주말 여부(평일 0, 주말 1)                       |
| sales_count | 해당 날짜와 시간대에 판매된 커피의 수            |
| total_sales | 해당 날짜와 시간대의 총판매 금액                 |

3. 데이터 전처리
결측치는 없으며, 같은 의미의 중복 속성(Month_name, Weekday)과  total_sales 속성은 제외한다.

4. 데이터 시각화와 분석
5. 데이터 모델링
6. 평가
7. 성찰
